---
kind: method
id: M:Autodesk.Revit.DB.RadialArray.GetCopiedMemberIds
source: html/f85c5b4b-2835-8f8b-fccf-3f690c1806b9.htm
---
# Autodesk.Revit.DB.RadialArray.GetCopiedMemberIds Method

Retrieves the copied member Ids of the Array.

## Syntax (C#)
```csharp
public override ICollection<ElementId> GetCopiedMemberIds()
```

## Returns
The copied member Ids of the Array